InformationRegisters/ЛБ_КонтактнаяИнформацияЗалогодателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КонтактнаяИнформацияЗалогодателей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРождения</Name>
					<Comment>Дата рождения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияСтрана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияОбласть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияРайон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРожденияНаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПоПрописке</Name>
					<Comment>Адрес по прописке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПоПропискеСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдрес</Name>
					<Comment>Фактический адрес</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдресСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдрес</Name>
					<Comment>Адрес для почтовой рассылки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдресСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонДополнительный</Name>
					<Comment>Телефон дополнительный</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонДополнительныйСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Email</Name>
					<Comment>E-mail</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонКонтактногоЛица</Name>
					<Comment>Телефон</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонКонтактногоЛицаСтруктура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформацииДругое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПоПропискеВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийАдресВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдресВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Фамилия_А</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя_А</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество_А</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияФИО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеИзмененияФИО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОснованияИзмененияФИО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменилсяАдресПрописки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменилсяФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменилсяПочтовыйАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияАдресаПоПрописке</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияФактическогоАдреса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияПочтовогоАдреса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЛомбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ЛБ_ПодборДокументовКлиента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Залогодатель") Тогда
		Залогодатель = Параметры.Залогодатель; 
		Элементы.Залогодатель.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("ВидДокументаЗалогодателя") Тогда
		ВидДокументаЗалогодателя = Параметры.ВидДокументаЗалогодателя; 
		Элементы.ВидДокументаЗалогодателя.ТолькоПросмотр = Истина;
	КонецЕсли;	
	
	Если Параметры.Свойство("Дата") Тогда
	    ДатаПроверки = Параметры.Дата;
	КонецЕсли;
	
	Если ДатаПроверки = Дата(1,1,1) Тогда
		ДатаПроверки = ТекущаяДата();
	КонецЕсли;
	
	ПолучитьДатуРождения();
	ЗаполнитьТаблицуДокументов();
КонецПроцедуры   

&НаСервере
Процедура ПолучитьДатуРождения()
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", ДатаПроверки);
    Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		ДатаРождения = Выборка.ДатаРождения;
	КонецЕсли;	
КонецПроцедуры 	

&НаСервере
Процедура ЗаполнитьТаблицуДокументов() 
	ТаблицаДокументов.Очистить();
	Если НЕ ЗначениеЗаполнено(Залогодатель) ИЛИ НЕ ЗначениеЗаполнено(ВидДокументаЗалогодателя) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаПроверки);
	Запрос.УстановитьПараметр("ВидДокументаЗалогодателя", ВидДокументаЗалогодателя);
    Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя КАК ДокументЗалогодателя
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
	               |			&Дата,
	               |			ДокументЗалогодателя.Владелец = &Залогодатель
	               |				И ВидДокументаЗалогодателя = &ВидДокументаЗалогодателя
	               |				И ДатаСмерти = &ПустаяДата
	               |				И ДокументНеДействителен = ЛОЖЬ) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";   
	ТаблицаДокументов.Загрузить(Запрос.Выполнить().Выгрузить());
	ЕстьСвидетельствоОРождении = ложь;
	Для каждого Стр из ТаблицаДокументов цикл 		
		Если (Стр.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении) Тогда
			ЕстьСвидетельствоОРождении = Истина;	
		КонецЕсли;	
		ЛБ_ОбщийМодуль.ПроверитьДействительностьДокумента(Стр, ДатаРождения,,ДатаПроверки);
	КонецЦикла;
	
	Если ЕстьСвидетельствоОРождении Тогда
		//проверим недействительность свидетельства о рождении если есть паспорт
        ЛБ_ОбщийМодуль.ПроверитьДействительностьСвидетельствоОРождении(ТаблицаДокументов);
	КонецЕсли;		
	
	Удстроки = Новый списокЗначений;
	Для каждого Стр из ТаблицаДокументов цикл
		Если Стр.ПроверкаНеДействителен Тогда
			УдСтроки.Добавить(Стр);
		КонецЕсли;	
	КонецЦикла;	
	
	Для каждого эл Из УдСтроки Цикл
		ТаблицаДокументов.Удалить(эл.Значение);
	Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыборДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ЗалогодательПриИзменении(Элемент)
	ЗаполнитьТаблицуДокументов();
	ПолучитьДатуРождения();
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаЗалогодателяПриИзменении(Элемент)
	ЗаполнитьТаблицуДокументов();
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ВыборДокумента();
КонецПроцедуры 

&НаКлиенте
Процедура ВыборДокумента()
	ТекСтрока = Элементы.ТаблицаДокументов.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("ДокументЗалогодателя", ТекСтрока.ДокументЗалогодателя);
		Этаформа.Закрыть(СтруктураВозврата);
    КонецЕсли;
КонецПроцедуры
